<?php
/* ------------------- */
/* 定数の定義 */
/* ------------------- */

// フラッシュメッセージ
define('FLASH_MESSAGE', [
    1 => "メールアドレスが更新できませんでした。もう一度入力してください。",
    2 => "メールアドレスを更新しました。",
    3 => "ニックネームが更新できませんでした。もう一度入力してください。",
    4 => "ニックネームを更新しました。",
    5 => "新しいパスワードと新しいパスワードの確認が一致しません。もう一度入力してください。",
    6 => "パスワードを更新しました",
    7 => "パスワードが違います。",
    8 => "画像を更新しました。",
    9 => "メールアドレスまたはパスワードが違います。",
    10 => "ログインに成功しました",
    11 => "講師は生徒画面にログインできません。",
    12 => "ログインまたは登録を完了してください。",
    13 => "ログインしていません。",
    14 => "不正なアクセスです。",
    15 => "パスワードが一致しません。もう一度入力してください。",
    16 => "ご入力頂いたメールアドレスはすでに登録されています。",
    17 => "仮登録完了。\nご登録頂いたメールアドレスに本登録ご案内メールをお送りしました。\n引き続き本登録を行ってください。",
    18 => "ご登録が完了しました。",
    19 => "生徒は講師画面にログインできません。",
    "FILE" => [
        1 => "ファイルサイズは1MB未満にしてください。",
        2 => "画像ファイルを添付してください。(jpg, jpeg, png)",
    ]
]);

// メールの送信内容に関する定義
define('MAIL', [
    1 => "【サービス名】　登録完了のお知らせ",
    2 => "【サービス名】　本登録のご案内",
]);

// 国名
define('COUNTRY', [
    "Japan",
    "Philippines",
    "USA",
    "England",
    "Austlaria",
    "Spain"
]);
